app/controllers/articles_controller.rb

  def create
    @article = Article.new(artiecle_params)
    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "good"], ["body", "nobody but you"], ["created_at", "2022-06-06 09:16:42.212439"], ["updated_at", "2022-06-06 09:16:42.212439"]]

  def update
    @article = Article.find(params[:id])
      if @article.update(artiecle_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "high high hopes for a living;"], ["updated_at", "2022-06-06 09:31:49.330891"], ["id", 3]]